Tekla Open API Reference for Tekla Structures 2025
BooleanPart.Modify Method
 Currently it is not possible to modify the boolean part as there is nothing that can be modified for it. Calling this function will actually call modify for the operative part member.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace